In [3]:
import pandas as pd

In [4]:
# Criando uma lista para que possa ser lida como tabela em Pandas
nome = ['Douglas', 'Daniela', 'Pedro', 'Maria', 'Eduardo', 'Ester']

In [5]:
# Criando uma tabela de coluna única em Pandas (Series)
serie = pd.Series(nome)
print(serie)

0    Douglas
1    Daniela
2      Pedro
3      Maria
4    Eduardo
5      Ester
dtype: object

In [6]:
# Criando uma tabela de várias colunas em Pandas (DataFrame)
nome = ['Douglas', 'Daniela', 'Pedro', 'Maria', 'Eduardo', 'Ester']
idade = [47, 9, 68, 67, 44, 39]
peso = [83, 35, 89, 65, 92, 67]
altura = [1.85, 1.39, 1.75, 1.68, 1.82, 1.72]
df = pd.DataFrame(zip(nome,idade,peso,altura),columns=['nome','idade','peso','altura'])
display(df)

      nome  idade  peso  altura
0  Douglas     47    83    1.85
1  Daniela      9    35    1.39
2    Pedro     68    89    1.75
3    Maria     67    65    1.68
4  Eduardo     44    92    1.82
5    Ester     39    67    1.72

In [7]:
# Exibindo mais de uma linha pelo rótulo
df.loc[[0,2,4]]

      nome  idade  peso  altura
0  Douglas     47    83    1.85
2    Pedro     68    89    1.75
4  Eduardo     44    92    1.82

In [8]:
# Exibindo mais de uma linha pelo índice
df.iloc[[0,2,4]]

      nome  idade  peso  altura
0  Douglas     47    83    1.85
2    Pedro     68    89    1.75
4  Eduardo     44    92    1.82

In [9]:
medidas = df.describe()
display(medidas)

           idade       peso    altura
count   6.000000   6.000000  6.000000
mean   45.666667  71.833333  1.701667
std    21.667179  21.226556  0.165096
min     9.000000  35.000000  1.390000
25%    40.250000  65.500000  1.690000
50%    45.500000  75.000000  1.735000
75%    62.000000  87.500000  1.802500
max    68.000000  92.000000  1.850000

In [10]:
'''
Agora vamos supor que desejamos armazenar uma subtabela da tabela medidas
apenas com as linhas de média e desvio padrão, fatiadas pelo rótulo
'''
resumo = medidas.loc[['mean','std']]
display(resumo)

          idade       peso    altura
mean  45.666667  71.833333  1.701667
std   21.667179  21.226556  0.165096

In [25]:
'''
Agora vamos supor que desejamos armazenar uma subtabela da tabela medidas
apenas com as linhas da tabela original, fatiadas pelo rótulo e exibidas
e armazenadas em ordem diferente da original
'''
resumo2 = round(medidas.loc[['std','mean']],2)
display(resumo2)

      idade   peso  altura
std   21.67  21.23    0.17
mean  45.67  71.83    1.70

## Fatiamento de colunas

In [12]:
# Fatiando uma coluna pelo seu rótulo
'''
Agora vamos buscar todas as linhas do dataframe original para a coluna
nome
'''
df.loc[:,['nome']]

      nome
0  Douglas
1  Daniela
2    Pedro
3    Maria
4  Eduardo
5    Ester

In [13]:
'''
Agora vamos buscar todas as linhas do dataframe original para as colunas
nome e idade
'''
df.loc[:,['nome','idade']]

      nome  idade
0  Douglas     47
1  Daniela      9
2    Pedro     68
3    Maria     67
4  Eduardo     44
5    Ester     39

In [14]:
'''
Agora vamos buscar as linhas 0, 2 e 4 do dataframe original para as colunas
nome e idade
'''
df.loc[[0,2,4],['nome','idade']]

      nome  idade
0  Douglas     47
2    Pedro     68
4  Eduardo     44

In [15]:
'''
Agora vamos criar a tabela medidas como um describe da tabela original
e fatiar pelo rótulo o desvio padrão e média para as idades e para o peso
'''
medidas.loc[['std','mean'],['idade','peso']]

          idade       peso
std   21.667179  21.226556
mean  45.666667  71.833333

In [16]:
# Exibindo colunas pelo índice
'''
Vamos exibir a coluna nome e todas as suas linhas pelo índice
'''
df.iloc[:,0]

0    Douglas
1    Daniela
2      Pedro
3      Maria
4    Eduardo
5      Ester
Name: nome, dtype: object

In [17]:
# Exibindo colunas pelo índice
'''
Vamos exibir a coluna nome, a coluna idade e todas as suas linhas
'''
df.iloc[:,[0,1]]

      nome  idade
0  Douglas     47
1  Daniela      9
2    Pedro     68
3    Maria     67
4  Eduardo     44
5    Ester     39

In [18]:
# Alternativa 01 para exibir todas as linhas de uma coluna
df[['nome']]

      nome
0  Douglas
1  Daniela
2    Pedro
3    Maria
4  Eduardo
5    Ester

In [19]:
# Alternativa 02 para exibir todas as linhas de uma coluna
df.nome

0    Douglas
1    Daniela
2      Pedro
3      Maria
4    Eduardo
5      Ester
Name: nome, dtype: object

In [20]:
df.idade

0    47
1     9
2    68
3    67
4    44
5    39
Name: idade, dtype: int64

# Fatiamento de células (cruzamento de linha com coluna) de um dataframe

In [21]:
# Fatiando uma célula pelo seu rótulo
df.loc[0,'idade']

47

In [22]:
# Fatiando uma célula pelo seu índice
df.iloc[0,1]

47

In [23]:
'''
Agora vamos buscar a coluna idade pelo seu rótulo e a linha 0
pelo seu índice
'''
df['idade'][0]

47

In [24]:
'''
Existe um método alternativo ao iloc para exibir uma célula pelos
seus índices de linha e coluna
Exemplo:
Imagine que você deseja saber a idade presente na linha de rótulo 0
'''
df.iat[0,1]

47